Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAK169.atdf
      <value-group caption="Shared ADC Clock Divider bits" name="ADCCON2__ADCDIV">
         <value caption="254 * Tq = Tad7" name="" value="0x7f" />
         <value caption="6 * Tq = Tad7" name="" value="0x3" />
         <value caption="4 * Tq = Tad7" name="" value="0x2" />
         <value caption="2 * Tq = Tad7" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Request Override bit" name="ADCCON2__ADCEIOVR">
         <value caption="Early interrupt generation is not overridden and interrupt generation is controlled by the ADCEIEN1 and ADCEIEN2 registers" name="" value="0x1" />
         <value caption="Early interrupt generation is overridden and interrupt generation is controlled by the ADCGIRQEN1 and ADCGIRQEN2 registers" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Enable bit" name="ADCCON2__EOSIEN">
         <value caption="Interrupt will be generated when EOSRDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the EOSRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/VREF Voltage Fault Interrupt Enable bit" name="ADCCON2__REFFLTIEN">
         <value caption="Interrupt will be generated when the REFFLT bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the REFFLT bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/VREF Voltage Ready Interrupt Enable bit" name="ADCCON2__BGVRIEN">
         <value caption="Interrupt will be generated when the BGVRDDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the BGVRRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample Time for the Shared ADC bits" name="ADCCON2__SAMC">
         <value caption="1025 Tad7" name="" value="0x3ff" />
         <value caption="3 Tad7" name="" value="0x1" />
         <value caption="2 Tad7" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitor Voltage Divider Setting bit" name="ADCCON2__CVDCPL">
         <value caption="7 * 2.5 pF = 17.5 pF" name="" value="0x7" />
         <value caption="6 * 2.5 pF = 15 pF" name="" value="0x6" />
         <value caption="5 * 2.5 pF = 12.5 pF" name="" value="0x5" />
         <value caption="4 * 2.5 pF = 10 pF" name="" value="0x4" />
         <value caption="3 * 2.5 pF = 7.5 pF" name="" value="0x3" />
         <value caption="2 * 2.5 pF = 5 pF" name="" value="0x2" />
         <value caption="1 * 2.5 pF = 2.5 pF" name="" value="0x1" />
         <value caption="0 * 2.5 pF = 0 pF" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Status bit" name="ADCCON2__EOSRDY">
         <value caption="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" name="" value="0x1" />
         <value caption="Scanning has not completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref / AVdd BOR Fault Status bit" name="ADCCON2__REFFLT">
         <value caption="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap orVref fault will be caused by a BOR of the analog Vdd supply." name="" value="0x1" />
         <value caption="Band gap and Vref voltage are working properly" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Voltage/ADC Reference Voltage Status bit" name="ADCCON2__BGVRRDY">
         <value caption="Both band gap voltage and ADC reference voltages (Vref) are ready" name="" value="0x1" />
         <value caption="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Select bits" name="ADCCON3__ADINSEL">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x2d" />
         <value caption="MAX_AN_INPUT + 2 = IVTEMP" name="" value="0x2c" />
         <value caption="MAX_AN_INPUT + 1 = IVREF" name="" value="0x2b" />
         <value caption="MAX_AN_INPUT = AN[MAX_AN_INPUT]" name="" value="0x2a" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Global Software Trigger bit" name="ADCCON3__GSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GSWTRG bit as the trigger signal" name="" value="0x1" />
         <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Global Level Software Trigger bit" name="ADCCON3__GLSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" name="" value="0x1" />
         <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Individual ADC Input Conversion Request bit" name="ADCCON3__RQCNVRT">
         <value caption="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" name="" value="0x1" />
         <value caption="Do not trigger the conversion" name="" value="0x0" />
      </value-group>
