Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAK169.atdf
         <register caption="" name="GLCDCURDATA125" offset="0x9F4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3115" />
            <bitfield mask="0x000000F0" name="PIXEL3114" />
            <bitfield mask="0x00000F00" name="PIXEL3113" />
            <bitfield mask="0x0000F000" name="PIXEL3112" />
            <bitfield mask="0x000F0000" name="PIXEL3111" />
            <bitfield mask="0x00F00000" name="PIXEL3110" />
            <bitfield mask="0x0F000000" name="PIXEL319" />
            <bitfield mask="0xF0000000" name="PIXEL318" />
         </register>
         <register caption="" name="GLCDCURDATA126" offset="0x9F8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3123" />
            <bitfield mask="0x000000F0" name="PIXEL3122" />
            <bitfield mask="0x00000F00" name="PIXEL3121" />
            <bitfield mask="0x0000F000" name="PIXEL3120" />
            <bitfield mask="0x000F0000" name="PIXEL3119" />
            <bitfield mask="0x00F00000" name="PIXEL3118" />
            <bitfield mask="0x0F000000" name="PIXEL3117" />
            <bitfield mask="0xF0000000" name="PIXEL3116" />
         </register>
         <register caption="" name="GLCDCURDATA127" offset="0x9FC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3131" />
            <bitfield mask="0x000000F0" name="PIXEL3130" />
            <bitfield mask="0x00000F00" name="PIXEL3129" />
            <bitfield mask="0x0000F000" name="PIXEL3128" />
            <bitfield mask="0x000F0000" name="PIXEL3127" />
            <bitfield mask="0x00F00000" name="PIXEL3126" />
            <bitfield mask="0x0F000000" name="PIXEL3125" />
            <bitfield mask="0xF0000000" name="PIXEL3124" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT0" offset="0xa00" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT1" offset="0xa04" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT2" offset="0xa08" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT3" offset="0xa0c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT4" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT5" offset="0xa14" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT6" offset="0xa18" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT7" offset="0xa1c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT8" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT9" offset="0xa24" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT10" offset="0xa28" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT11" offset="0xa2c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT12" offset="0xa30" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT13" offset="0xa34" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT14" offset="0xa38" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Cursor LUT Register x (x = 0-15)" name="GLCDCURLUT15" offset="0xa3c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
      </register-group>
      <value-group caption="RGB Sequential Modes bit" name="GLCDMODE__RGBSEQ">
         <value caption="BT.656" name="" value="0x7" />
         <value caption="YUYV" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="Parallel RGB (RGB888 RGB666 RGB332)" name="" value="0x0" />
      </value-group>
